// Переменная для хранения названия города
let city = "Санкт-Петербург";

// Переменная для хранения температуры воздуха
let temperature = -11;

// Выводим информацию о городе и температуре в консоль
console.log("Город:", city);

console.log("Температура воздуха сегодня:", temperature + "°C");

// Первое число
let a = 7;

// Второе число
let b = 3;

// Третье число
let c = 5;

// Складываем первые два числа и умножаем результат на третье
let result = (a + b) * c;

// Выводим результат вычислений в консоль
console.log(result);