let price = 100 // Присваиваем значение переменой

price = 150 // Изменяем значение

console.log(price) // Выводим в консоль

let count = 100 // Присваиваем значение переменой

let count = 150 // Ошибка, так как нельзя объявить повторно в одной и той же области

const total = 100 // Присваиваем значение переменой

const total = 150 // Ошибка, так как нельзя объявить повторно в одной и той же области

const number = 100 // Присваиваем значение переменой

number = 150 // const - это константа, которую нельзя перезаписать