// 1
function myFunction() {
    let localVar = "Привет, я локальная переменная!";
    console.log(localVar);
}

myFunction();

console.log(localVar);

// Когда ты создаёшь переменную внутри функции с помощью let или const, эта переменная существует и срабатывает только внутри этой функции.
// Попытка обратиться к ней вне функции вызывает ошибку.

// 2
{
    let blockVar = "Я живу только внутри этого блока!";
    console.log(blockVar);
}

console.log(blockVar);

// Пока мы внутри блока, переменная выводится. Но как только блок заканчивается, переменная исчезает из видимости. 
// Поэтому попытка обратиться к ней снаружи блока вызывает ошибку.

// 3
// Hoisting — это когда переменные и функции поднимаются вверх своего блока или функции ещё до того, как код начнёт выполняться. 
// То есть интерпретатор знает о них заранее, даже если в коде они написаны позже.

// Проблемы, связанные с hoisting:
// Undefined
// ReferenceError с let и const, если обращаешься к ним раньше времени.
// Функции и переменные с одинаковыми именами могут перекрывать друг друга из-за поднятия, что создаёт путаницу.

// Пример 1
console.log(a); // Undefined — переменная поднята, но значения нет
var a = 10; // Присваивание остается на месте
console.log(a); // 10

// Пример 2
console.log(b); // Ошибка
let b = 5; // Нельзя обратиться раньше времени будет ошибка.

// Пример 3
greet(); // Привет!

function greet() {
    console.log("Привет!"); // Полностью поднимаются
}

// Пример 4
sayHi(); // Ошибка
const sayHi = function() { // Значение не присвоено, поэтому ошибка
    console.log("Привет!");
}